# Intro to Pandas

## Rename Index and Columns Exercises

1. Import Pandas and Numpy

In [1]:
# Basic imports

import numpy as np
from pandas import Series,DataFrame
import pandas as pd

#### Use the following DF

In [2]:
# set the data
npdata = np.random.randn(16).reshape(4,4)

# Create the DF
df = DataFrame(data= npdata, index = ['A', 'B', 'C', 'D'], columns= ['Col1', 'Col2', 'Col3', 'Col4'])

# Show
df

       Col1      Col2      Col3      Col4
A -0.222474 -0.936623  0.014823  0.355336
B  1.307498 -1.119087  0.994633 -0.702565
C -0.164466 -0.644205  0.309088  1.322840
D  1.606476  1.215661  0.684424  1.331813

## The .rename() method

1. Put all the rows indexes lower case

In [3]:
# Rows lower
df.rename(str.lower, axis='index')

       Col1      Col2      Col3      Col4
a -0.222474 -0.936623  0.014823  0.355336
b  1.307498 -1.119087  0.994633 -0.702565
c -0.164466 -0.644205  0.309088  1.322840
d  1.606476  1.215661  0.684424  1.331813

2. Put all the columns name upper case

In [4]:
# Columns upper

df.rename(str.upper, axis='columns')

       COL1      COL2      COL3      COL4
A -0.222474 -0.936623  0.014823  0.355336
B  1.307498 -1.119087  0.994633 -0.702565
C -0.164466 -0.644205  0.309088  1.322840
D  1.606476  1.215661  0.684424  1.331813

### Rename using mapping

3. Rename all the rows with the following names ('alfa', 'beta', 'gamma', 'teta')

In [6]:
# Rename index
df.rename(index={'A':'alfa','B':'beta','C':'gamma','D':'delta'})

           Col1      Col2      Col3      Col4
alfa  -0.222474 -0.936623  0.014823  0.355336
beta   1.307498 -1.119087  0.994633 -0.702565
gamma -0.164466 -0.644205  0.309088  1.322840
delta  1.606476  1.215661  0.684424  1.331813

4. Rename 'Col1' to 'A1' and 'Col4' to 'D4'

In [7]:
# Rename columns
df.rename(columns={'Col1':'A1','Col4':'D4'})

         A1      Col2      Col3        D4
A -0.222474 -0.936623  0.014823  0.355336
B  1.307498 -1.119087  0.994633 -0.702565
C -0.164466 -0.644205  0.309088  1.322840
D  1.606476  1.215661  0.684424  1.331813

5. Rename again all the columns of the df using the following list.

In [ ]:
new_cols = ['ab','bc','cd','df']

In [9]:
# Rename again df
df.columns=['ab','bc','cd','df']
df

         ab        bc        cd        df
A -0.222474 -0.936623  0.014823  0.355336
B  1.307498 -1.119087  0.994633 -0.702565
C -0.164466 -0.644205  0.309088  1.322840
D  1.606476  1.215661  0.684424  1.331813

# Good Job!